# SlantedColumnBaseCutStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SlantedColumnBaseCutStyle Property
ParameterTypeId Class See Also
---
"Base Cut Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SlantedColumnBaseCutStyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlantedColumnBaseCutStyle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SlantedColumnBaseCutStyle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace